### Pandas merge

In [ ]:
# Pandas merge function -- we merge multiple data frame in single data frame with the help of merge function

In [1]:
# pandas merge connects columns or indexes in dataframe based on one or more keys

In [2]:
# pandas merge function ka use karke hum multiple data frame ko merge kar sakte hai with column or indexes

In [3]:
# Ye dataframe ke join operation ka entry ponits hota hai

In [4]:
# now import pandas 
import pandas as pd

In [6]:
# now made a dataframe
df1 = pd.DataFrame({'ID':[1,2,3,4],
                  'Class':[9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [23]:
# now made a second dataframe
df2 = pd.DataFrame({'ID':[1,2,3,5],
                  'Name':['Arman','Ashif','Ysuf','Imran']})
df2

   ID   Name
0   1  Arman
1   2  Ashif
2   3   Ysuf
3   5  Imran

##### On

In [20]:
# now merge  both the DataFrame
# if humko key value se DataFrame banana ho to hum on function ka use karenge 

pd.merge(df1,df2,on = 'ID') # both Data Frame is merge based on ID and we use ON function 

# if hamare data frame me koi value common hai to hum On function ka use karenge

   ID  Class   Name
0   1      9  Arman
1   2     10  Ashif
2   3     11   Ysuf
3   4     12  Imran

In [10]:
# if we want to change the parameter of the dataframe 
pd.merge(df2,df1,on = 'ID')

   ID   Name  Class
0   1  Arman      9
1   2  Ashif     10
2   3   Ysuf     11
3   4  Imran     12

In [24]:
# if the id having some extra value then that function give output only common values 

pd.merge(df1,df2,on = 'ID')

# it give only three 3 out put

   ID  Class   Name
0   1      9  Arman
1   2     10  Ashif
2   3     11   Ysuf

####  How

In [25]:
pd.merge(df1,df2,on = 'ID',how = 'inner')
# inner function is work like a intersection comun value in bothe the table

   ID  Class   Name
0   1      9  Arman
1   2     10  Ashif
2   3     11   Ysuf

#### left

In [26]:
pd.merge(df1,df2,on = 'ID',how = 'left')

   ID  Class   Name
0   1      9  Arman
1   2     10  Ashif
2   3     11   Ysuf
3   4     12    NaN

#### right

In [27]:
pd.merge(df1,df2,on = 'ID',how = 'right')

   ID  Class   Name
0   1    9.0  Arman
1   2   10.0  Ashif
2   3   11.0   Ysuf
3   5    NaN  Imran

#### outer

In [28]:
# if we want to print overall value
pd.merge(df1,df2,on = 'ID',how = 'outer')

# here both the table are printed with NaN value

   ID  Class   Name
0   1    9.0  Arman
1   2   10.0  Ashif
2   3   11.0   Ysuf
3   4   12.0    NaN
4   5    NaN  Imran

#### indicator

In [29]:
# if we want to know the particular value belong to which columnn then we use indicator 
pd.merge(df1,df2,on = 'ID',how = 'outer',indicator = True)

   ID  Class   Name      _merge
0   1    9.0  Arman        both
1   2   10.0  Ashif        both
2   3   11.0   Ysuf        both
3   4   12.0    NaN   left_only
4   5    NaN  Imran  right_only

In [30]:
# now call the dataframe 
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [31]:
df2

   ID   Name
0   1  Arman
1   2  Ashif
2   3   Ysuf
3   5  Imran

#####  if both the DataFrame is different and if we want  to merge then we use this function

In [32]:
 
df3 = pd.DataFrame({'ID':[1,2,3,4],
                  'Class':[9,10,11,12]})
df3

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [36]:
df4 = pd.DataFrame({'ID':[5,6,7,8],
                  'Name':['Arman','Ashif','Yusuf','Imran']})
df4

   ID   Name
0   5  Arman
1   6  Ashif
2   7  Yusuf
3   8  Imran

In [37]:
# merge  both the dataframe
# if mere paas multi index ho and different different value then we use this function 

pd.merge(df3,df4,left_index = True,right_index = True)

   ID_x  Class  ID_y   Name
0     1      9     5  Arman
1     2     10     6  Ashif
2     3     11     7  Yusuf
3     4     12     8  Imran

##### If two DataFrame is Same then we use this function

In [40]:
df5 = pd.DataFrame({'ID':[5,6,7,8],
                  'Name':['Arman','Ashif','Yusuf','Imran']})
df5

   ID   Name
0   5  Arman
1   6  Ashif
2   7  Yusuf
3   8  Imran

In [42]:
df6 = pd.DataFrame({'ID':[5,6,7,8],
                  'Name':['Arman','Ashif','Yusuf','Imran']})
df6

   ID   Name
0   5  Arman
1   6  Ashif
2   7  Yusuf
3   8  Imran

In [43]:
pd.merge(df5,df6,on = 'ID',suffixes = ('_01','_0'))

# here the suffix function is use

   ID Name_x Name_y
0   5  Arman  Arman
1   6  Ashif  Ashif
2   7  Yusuf  Yusuf
3   8  Imran  Imran